maivananh111/STM32_RTOSSDK/peripherals/source/usart.cpp
/*
 * usart.cpp
 *
 *  Created on: 20 thg 11, 2022
 *      Author: anh
 */
#include "peripheral_config.h"
#if ENABLE_USART
#include "periph/usart.h"

#include "math.h"
#include "string.h"

#include "periph/gpio.h"
#include "periph/systick.h"
#include "periph/rcc.h"
#if CONFIG_USE_LOG_MONITOR && USART_LOG
#include "system/log.h"
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */


#if CONFIG_USE_LOG_MONITOR && USART_LOG
static const char *TAG = "USART";
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */

void USART_IRQ_Handler(usart *usart);

usart::usart(USART_TypeDef *usart){
	_usart = usart;
}

stm_ret_t usart::init(usart_config_t *conf){
	stm_ret_t ret;
	_conf = conf;
#if ENABLE_DMA
	_rxdma = _conf -> rxdma;
	_txdma = _conf -> txdma;
#endif /* ENABLE_DMA */
	__IO uint32_t usart_bus_frequency = 0UL;

	gpio_port_clock_enable(_conf -> txport);
	gpio_port_clock_enable(_conf -> rxport);

#if defined(STM32F1)
	gpio_set_alternatefunction(conf->txport, conf->txpin, GPIO_ALTERNATE_PUSHPULL);
	gpio_set_mode(conf->rxport, conf->rxpin, GPIO_INPUT);
#elif defined(STM32F4)
	if(
#if defined(USART1)
			_usart == USART1
#endif /* defined(USART1) */
			||
#if defined(USART2)
			_usart == USART2
#endif /* defined(USART2) */
			||
#if defined(USART3)
			_usart == USART3
#endif /* defined(USART3) */
			){
		gpio_set_alternatefunction(_conf -> txport, _conf -> txpin, AF7_USART1_3);
		gpio_set_alternatefunction(_conf -> rxport, _conf -> rxpin, AF7_USART1_3);
	}
	else{
#if defined(UART7) & defined(UART8)
		gpio_set_alternatefunction(_conf -> txport, _conf -> txpin, AF8_USART4_8);
		gpio_set_alternatefunction(_conf -> rxport, _conf -> rxpin, AF8_USART4_8);
#else
		gpio_set_alternatefunction(_conf -> txport, _conf -> txpin, AF8_USART4_6);
		gpio_set_alternatefunction(_conf -> rxport, _conf -> rxpin, AF8_USART4_6);
#endif /* defined(UART7) & defined(UART8) */
	}
	gpio_set_alternatefunction_type(_conf -> txport, _conf -> txpin, GPIO_OUTPUT_PUSHPULL);
	gpio_set_alternatefunction_type(_conf -> rxport, _conf -> rxpin, GPIO_OUTPUT_PUSHPULL);
#endif /* STM32F4 */

#if defined(USART1)
	if(_usart == USART1){
		RCC -> APB2ENR |= RCC_APB2ENR_USART1EN;
		usart_bus_frequency = rcc_get_bus_frequency(APB2);
	}
#endif /* defined(USART1) */
#if defined(USART2)
	if(_usart == USART2){
		RCC -> APB1ENR |= RCC_APB1ENR_USART2EN;
		usart_bus_frequency = rcc_get_bus_frequency(APB1);
	}
#endif /* defined(USART2) */
#if defined(USART3)
	if(_usart == USART3){
		RCC -> APB1ENR |= RCC_APB1ENR_USART3EN;
		usart_bus_frequency = rcc_get_bus_frequency(APB1);
	}
#endif /* defined(USART3) */
#if defined(UART4)
	if(_usart == UART4){
		RCC -> APB1ENR |= RCC_APB1ENR_UART4EN;
		usart_bus_frequency = rcc_get_bus_frequency(APB1);
	}
#endif /* defined(UART4) */
#if defined(UART5)
	if(_usart == UART5){
		RCC -> APB1ENR |= RCC_APB1ENR_UART5EN;
		usart_bus_frequency = rcc_get_bus_frequency(APB1);
	}
#endif /* defined(UART5) */
#if defined(USART6)
	if(_usart == USART6){
		RCC -> APB2ENR |= RCC_APB2ENR_USART6EN;
		usart_bus_frequency = rcc_get_bus_frequency(APB2);
	}
#endif /* defined(USART6) */
#if defined(UART7)
	if(_usart == UART7){
		RCC -> APB1ENR |= RCC_APB1ENR_UART7EN;
		usart_bus_frequency = rcc_get_bus_frequency(APB1);
	}
#endif /* defined(UART7) */
#if defined(UART8)
	if(_usart == UART8){
		RCC -> APB1ENR |= RCC_APB1ENR_UART8EN;
		usart_bus_frequency = rcc_get_bus_frequency(APB1);
	}
#endif /* defined(UART8) */


	_usart -> CR1 |= USART_CR1_UE | USART_CR1_TE | USART_CR1_RE;

	float USARTDIV = (float)(usart_bus_frequency/(_conf -> baudrate * 16.0));
	uint16_t DIV_Fraction = 0x00UL;
	uint16_t DIV_Mantissa = (uint16_t)USARTDIV;

	float Fraction = (float)(((float)(((uint16_t)(USARTDIV * 100.0) - (uint16_t)(DIV_Mantissa * 100.0)) / 100.0)) * 16.0);
	DIV_Fraction = ceil(Fraction);
	_usart -> BRR = (DIV_Mantissa << 4) | (DIV_Fraction << 0);

	if(_conf -> control && (USART_INTERRUPT_CONTROL | USART_INTERRUPT_DMA_CONTROL)){

		if(_conf -> interruptpriority < CONFIG_RTOS_MAX_SYSTEM_INTERRUPT_PRIORITY){
			set_return(&ret, STM_ERR, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
			LOG_ERROR(TAG, "%s -> %s -> Invalid priority, please increase the priority value.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
#if CONFIG_FAIL_CHIP_RESET
#if CONFIG_USE_LOG_MONITOR && USART_LOG
			LOG_INFO(TAG, "Chip will reset after %ds.", CONFIG_WAIT_FOR_RESET_TIME);
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
			systick_delay_ms(CONFIG_WAIT_FOR_RESET_TIME*1000U);
			__NVIC_SystemReset();
#endif /* CONFIG_FAIL_CHIP_RESET */
			return ret;
		}

#if defined(USART1)
		if	   (_usart == USART1) IRQn = USART1_IRQn;
#endif /* defined(USART1) */
#if defined(USART2)
		else if(_usart == USART2) IRQn = USART2_IRQn;
#endif /* defined(USART2) */
#if defined(USART3)
		else if(_usart == USART3) IRQn = USART3_IRQn;
#endif /* defined(USART3) */
#if defined(UART4)
		else if(_usart == UART4)  IRQn = UART4_IRQn;
#endif /* defined(USART4) */
#if defined(UART5)
		else if(_usart == UART5)  IRQn = UART5_IRQn;
#endif /* defined(USART5) */
#if defined(USART6)
		else if(_usart == USART6) IRQn = USART6_IRQn;
#endif /* defined(USART6) */
#if defined(UART7)
		else if(_usart == UART7) IRQn = UART7_IRQn;
#endif /* defined(USART7) */
#if defined(UART8)
		else if(_usart == UART8) IRQn = UART8_IRQn;
#endif /* defined(UART8) */
		__NVIC_SetPriority(IRQn, _conf -> interruptpriority);
	}
	transmit('\n');

	return {STM_OKE, 0};
}

stm_ret_t usart::deinit(void){
	gpio_deinit(_conf -> txport, _conf -> txpin);
	gpio_deinit(_conf -> rxport, _conf -> rxpin);

#if defined(USART1)
	if(_usart == USART1) RCC -> APB2ENR &=~ RCC_APB2ENR_USART1EN;
#endif /* defined(USART1) */
#if defined(USART2)
	if(_usart == USART2) RCC -> APB1ENR &=~ RCC_APB1ENR_USART2EN;
#endif /* defined(USART2) */
#if defined(USART3)
	if(_usart == USART3) RCC -> APB1ENR &=~ RCC_APB1ENR_USART3EN;
#endif /* defined(USART3) */
#if defined(UART4)
	if(_usart == UART4) RCC -> APB1ENR &=~ RCC_APB1ENR_UART4EN;
#endif /* defined(UART4) */
#if defined(UART5)
	if(_usart == UART5) RCC -> APB1ENR &=~ RCC_APB1ENR_UART5EN;
#endif /* defined(UART5) */
#if defined(USART6)
	if(_usart == USART6) RCC -> APB2ENR &=~ RCC_APB2ENR_USART6EN;
#endif /* defined(USART6) */
#if defined(UART7)
	if(_usart == UART7) RCC -> APB1ENR &=~ RCC_APB1ENR_UART7EN;
#endif /* defined(UART7) */
#if defined(UART8)
	if(_usart == UART8) RCC -> APB1ENR &=~ RCC_APB1ENR_UART8EN;
#endif /* defined(UART8) */

	_usart -> CR1 = 0x00U;
	_usart -> CR2 = 0x00U;
	_usart -> BRR = 0x00U;
	__IO uint32_t tmp = _usart -> DR;
	tmp = _usart -> SR;
	(void)tmp;
	if(_conf -> control && (USART_INTERRUPT_CONTROL | USART_INTERRUPT_DMA_CONTROL)){
		__NVIC_ClearPendingIRQ(IRQn);
		__NVIC_DisableIRQ(IRQn);
	}

	return {STM_OKE, 0};
}

stm_ret_t usart::register_event_handler(void (*function_ptr)(usart_event_t event, void *param), void *param){
	stm_ret_t ret;
	if(_conf -> control && (USART_INTERRUPT_CONTROL | USART_INTERRUPT_DMA_CONTROL)) {
		handler_callback = function_ptr;
		parameter = param;

		return ret;
	}
	else{
		set_return(&ret, STM_UNSUPPORTED, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_WARN(TAG, "%s -> %s, USART peripheral control unsuported register event handler.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
	}

	return ret;
}


stm_ret_t usart::transmit(uint8_t data){
	stm_ret_t ret;

	_usart -> DR = data;

	ret = wait_flag_in_register_timeout(&(_usart -> SR), USART_SR_TC, FLAG_SET, USART_TIMEOUT);
	if(!is_oke(&ret)){
		set_return_line(&ret, __LINE__);
		return ret;
	}

	volatile uint32_t tmp = _usart -> SR;
	tmp = _usart -> DR;
	(void)tmp;

	return ret;
}


stm_ret_t usart::transmit(uint8_t *data, uint16_t len){
	stm_ret_t ret;
	uint16_t TxCount = len;

