maivananh111/STM32_RTOSSDK/peripherals/source/usart.cpp
	while(TxCount--) {
		_usart -> DR = *data++;

		ret = wait_flag_in_register_timeout(&(_usart -> SR), USART_SR_TC, FLAG_SET, USART_TIMEOUT);
		if(!is_oke(&ret)){
			set_return_line(&ret, __LINE__);
			return ret;
		}
	}
	return ret;
}



stm_ret_t usart::send_string(char *string){
	stm_ret_t ret;

	while(*string) {
		_usart -> DR = *string++;

		ret = wait_flag_in_register_timeout(&(_usart -> SR), USART_SR_TC, FLAG_SET, USART_TIMEOUT);
		if(!is_oke(&ret)){
			set_return_line(&ret, __LINE__);
			return ret;
		}
	}
	return ret;
}



stm_ret_t usart::receive(uint8_t *data){
	stm_ret_t ret;

	ret = wait_flag_in_register_timeout(&(_usart -> SR), USART_SR_RXNE, FLAG_SET, USART_TIMEOUT);
	if(!is_oke(&ret)){
		set_return_line(&ret, __LINE__);
		return ret;
	}

	(*data) = _usart -> DR;

	return ret;
}



stm_ret_t usart::receive(uint16_t len){
	stm_ret_t ret;
	__IO uint16_t RxCount = len;

	rxlen = len;
	rxcount = 0;
	reception = USART_RECEPTION_NORMAL;
	if(rxbuffer != NULL) {
		free(rxbuffer);
		rxbuffer = NULL;
	}
	rxbuffer = (uint8_t *)malloc((rxlen +1) * sizeof(uint8_t));
	if(rxbuffer == NULL){
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART memory allocation fail.", __FILE__, __FUNCTION__ );
#endif
		set_return(&ret, STM_ERR, __LINE__);
		return ret;
	}
	memset(rxbuffer, '\0', rxlen+1);

	while(RxCount--){
		ret = wait_flag_in_register_timeout(&(_usart -> SR), USART_SR_RXNE, FLAG_SET, USART_TIMEOUT);
		if(!is_oke(&ret)){
			set_return_line(&ret, __LINE__);
			return ret;
		}

		(*rxbuffer++) = _usart -> DR;
	}
	return ret;
}

uint8_t usart::get_data(void){
	return _usart -> DR;
}


stm_ret_t usart::transmit_start_it(uint8_t *data, uint16_t len){
	stm_ret_t ret;

	if(_conf -> control && (USART_INTERRUPT_CONTROL | USART_INTERRUPT_DMA_CONTROL)) {
		if(_conf -> interruptoption && (USART_TRANSMIT_INTERRUPT | USART_TRANSMIT_RECEIVE_INTERRUPT))
			_usart -> CR1 |= USART_CR1_TCIE;
		else {
#if CONFIG_USE_LOG_MONITOR && USART_LOG
			LOG_ERROR(TAG, "%s -> %s, USART not selected transmit interrupt.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
		}
	}
	else{
		set_return(&ret, STM_UNSUPPORTED, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART not selected interrupt control.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
		return ret;
	}

	_usart -> CR1 |= USART_CR1_PEIE;
	_usart -> CR3 |= USART_CR3_EIE;

	volatile uint32_t tmp = _usart -> SR;
	tmp = _usart -> DR;

	uint16_t TxLength = len;
	uint16_t TxCount  = 0;
	while(TxCount++ < TxLength) {
		_usart -> DR = *data++;

		ret = wait_flag_in_register_timeout(&(_usart -> SR), USART_SR_TC, FLAG_SET, USART_TIMEOUT);
		if(!is_oke(&ret)){
			set_return_line(&ret, __LINE__);
			return ret;
		}
	}

	_usart -> CR1 &=~ (USART_CR1_PEIE | USART_CR1_TCIE);
	_usart -> CR3 &=~ USART_CR3_EIE;

	__NVIC_ClearPendingIRQ(IRQn);
	__NVIC_EnableIRQ(IRQn);

	tmp = _usart -> SR;
	tmp = _usart -> DR;
	(void)tmp;

	return ret;
}



stm_ret_t usart::receive_start_it(uint16_t buffer_size){
	stm_ret_t ret;

	if(_conf -> control && (USART_INTERRUPT_CONTROL | USART_INTERRUPT_DMA_CONTROL)) {
		if(_conf -> interruptoption && (USART_RECEIVE_INTERRUPT | USART_TRANSMIT_RECEIVE_INTERRUPT))
			_usart -> CR1 |= USART_CR1_RXNEIE;
		else {
#if CONFIG_USE_LOG_MONITOR && USART_LOG
			LOG_ERROR(TAG, "%s -> %s, USART not selected receive interrupt.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
		}
	}
	else{
		set_return(&ret, STM_UNSUPPORTED, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART not selected interrupt control.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
		return ret;
	}

	rxlen = buffer_size;
	rxcount = 0;
	reception = USART_RECEPTION_NORMAL;
	if(rxbuffer != NULL) {
		free(rxbuffer);
		rxbuffer = NULL;
	}
	rxbuffer = (uint8_t *)malloc((rxlen +1) * sizeof(uint8_t));
	if(rxbuffer == NULL){
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART memory allocation fail.", __FILE__, __FUNCTION__ );
#endif
		set_return(&ret, STM_ERR, __LINE__);
		return ret;
	}
	memset(rxbuffer, '\0', rxlen+1);
	_usart -> CR1 |= USART_CR1_PEIE;
	_usart -> CR3 |= USART_CR3_EIE;

	__NVIC_ClearPendingIRQ(IRQn);
	__NVIC_EnableIRQ(IRQn);

	volatile uint32_t tmp = _usart -> SR;
	tmp = _usart -> DR;
	(void)tmp;

	return ret;
}

stm_ret_t usart::transmit_stop_it(void){
	stm_ret_t ret;

	if(_conf -> control && (USART_INTERRUPT_CONTROL | USART_INTERRUPT_DMA_CONTROL)) {
		if((_conf -> interruptoption && (USART_TRANSMIT_INTERRUPT | USART_TRANSMIT_RECEIVE_INTERRUPT))\
				&& (_usart -> CR1 & USART_CR1_TCIE)){

			_usart -> CR1 &=~ USART_CR1_TCIE;

			__NVIC_ClearPendingIRQ(IRQn);
			__NVIC_DisableIRQ(IRQn);

			return ret;
		}
		else{
#if CONFIG_USE_LOG_MONITOR && USART_LOG
			LOG_ERROR(TAG, "%s -> %s, USART not selected transmit interrupt.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
		}
	}

	set_return(&ret, STM_ERR, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
	LOG_ERROR(TAG, "%s -> %s, USART not started transmit interrupt.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */

	return ret;
}

stm_ret_t usart::receive_stop_it(void){
	stm_ret_t ret;

	if(_conf -> control && (USART_INTERRUPT_CONTROL | USART_INTERRUPT_DMA_CONTROL)) {
		if((_conf -> interruptoption && (USART_RECEIVE_INTERRUPT | USART_TRANSMIT_RECEIVE_INTERRUPT))\
					&& (_usart -> CR1 & USART_CR1_RXNEIE)){

			_usart -> CR1 &=~ USART_CR1_RXNEIE;

			__NVIC_ClearPendingIRQ(IRQn);
			__NVIC_DisableIRQ(IRQn);

			if(rxbuffer != NULL) {
				free(rxbuffer);
				rxbuffer = NULL;
			}
			rxcount = 0;
			rxlen = 0;
			reception = USART_RECEPTION_NORMAL;

			return ret;
		}
		else {
#if CONFIG_USE_LOG_MONITOR && USART_LOG
			LOG_ERROR(TAG, "%s -> %s, USART not selected receive interrupt.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
		}
	}

	set_return(&ret, STM_ERR, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
	LOG_ERROR(TAG, "%s -> %s, USART not started receive interrupt.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */

	return ret;
}

#if ENABLE_DMA
stm_ret_t usart::transmit_start_dma(uint8_t *data, uint16_t len){
	stm_ret_t ret;

	if(!(_conf -> control && (USART_DMA_CONTROl | USART_INTERRUPT_DMA_CONTROL)) || _txdma == NULL){
		set_return(&ret, STM_UNSUPPORTED, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART not selected dma control.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
		return ret;
	}

	_usart -> CR3 &=~ USART_CR3_DMAT;
	ret = _txdma -> start((uint32_t)data, (uint32_t)&_usart -> DR, len);
	if(!is_oke(&ret)){
		set_return_line(&ret, __LINE__);
		return ret;
	}

	_usart -> SR &=~ USART_SR_TC;
	_usart -> CR3 |= USART_CR3_DMAT;

	return ret;
}

stm_ret_t usart::receive_start_dma(uint16_t len){
	stm_ret_t ret;

