maivananh111/STM32_RTOSSDK/peripherals/source/usart.cpp
	if(!(_conf -> control && (USART_DMA_CONTROl | USART_INTERRUPT_DMA_CONTROL)) || _rxdma == NULL){
		set_return(&ret, STM_UNSUPPORTED, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART not selected dma control.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
		return ret;
	}

	rxlen = len;
	rxcount = 0;
	reception = USART_RECEPTION_NORMAL;
	if(rxbuffer != NULL) {
		free(rxbuffer);
		rxbuffer = NULL;
	}
	rxbuffer = (uint8_t *)malloc((rxlen +1) * sizeof(uint8_t));
	if(rxbuffer == NULL){
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART memory allocation fail.", __FILE__, __FUNCTION__ );
#endif
		set_return(&ret, STM_ERR, __LINE__);
		return ret;
	}
	memset(rxbuffer, '\0', rxlen+1);
	_usart -> CR3 &=~ USART_CR3_DMAR;
	ret = _rxdma -> start((uint32_t)&_usart -> DR, (uint32_t)rxbuffer, len);
	if(!is_oke(&ret)){
		set_return_line(&ret, __LINE__);
		return ret;
	}

	volatile uint32_t tmp = _usart -> SR;
	tmp = _usart -> DR;
	(void)tmp;

	_usart -> CR1 |= USART_CR1_PEIE;
	_usart -> CR3 |= USART_CR3_EIE;
	_usart -> CR3 |= USART_CR3_DMAR;

	return ret;
}

stm_ret_t usart::transmit_stop_dma(void){
	stm_ret_t ret;

	if(!(_conf -> control && (USART_DMA_CONTROl | USART_INTERRUPT_DMA_CONTROL)) || _txdma == NULL){
		set_return(&ret, STM_UNSUPPORTED, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART not selected dma control.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
		return ret;
	}

	if(_usart -> CR3 & USART_CR3_DMAT){
		_usart -> CR3 &=~ USART_CR3_DMAT;
		ret = _txdma -> stop();
		if(!is_oke(&ret)){
			set_return_line(&ret, __LINE__);
			return ret;
		}
		_usart -> CR1 &=~ USART_CR1_TXEIE;
	}

	else{
		set_return(&ret, STM_ERR, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART not started transmit dma.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
	}

	return ret;
}

stm_ret_t usart::receive_stop_dma(void){
	stm_ret_t ret;

	if(!(_conf -> control && (USART_DMA_CONTROl | USART_INTERRUPT_DMA_CONTROL)) || _rxdma == NULL){
		set_return(&ret, STM_UNSUPPORTED, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART not selected dma control.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
		return ret;
	}

	if(_usart -> CR3 & USART_CR3_DMAR){
		_usart -> CR3 &=~ USART_CR3_DMAR;
		ret = _rxdma -> stop();
		if(!is_oke(&ret)){
			set_return_line(&ret, __LINE__);
			return ret;
		}
		_usart -> CR1 &=~ USART_CR1_PEIE;
		_usart -> CR3 &=~ USART_CR3_EIE;

		if(rxbuffer != NULL) {
			free(rxbuffer);
			rxbuffer = NULL;
		}
		rxlen = 0;
		rxcount = 0;
		reception = USART_RECEPTION_NORMAL;
	}

	else{
		set_return(&ret, STM_ERR, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
		LOG_ERROR(TAG, "%s -> %s, USART not started receive dma.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */
	}

	return ret;
}
#endif /* ENABLE_DMA */



stm_ret_t usart::receive_to_idle_start_it(uint16_t buffer_size){
	stm_ret_t ret = receive_start_it(buffer_size);

	reception = USART_RECEPTION_TOIDLE;

	_usart -> CR1 |= USART_CR1_IDLEIE;

	return ret;
}
stm_ret_t usart::receive_to_idle_stop_it(void){
	stm_ret_t ret = receive_stop_it();

	_usart -> CR1 &=~ USART_CR1_IDLEIE;

	return ret;
}

#if ENABLE_DMA
stm_ret_t usart::receive_to_idle_start_it_dma(uint16_t buffer_size){
	stm_ret_t ret = receive_start_dma(buffer_size);

	reception = USART_RECEPTION_TOIDLE;

	_usart -> CR1 |= USART_CR1_IDLEIE;

	__NVIC_ClearPendingIRQ(IRQn);
	__NVIC_EnableIRQ(IRQn);

	return ret;
}

stm_ret_t usart::receive_to_idle_stop_it_dma(void){
	stm_ret_t ret = receive_stop_dma();

	_usart -> CR1 &=~ USART_CR1_IDLEIE;

	return ret;
}
#endif /* ENABLE_DMA */

stm_ret_t usart::receive_to_endchar_start_it(uint16_t buffer_size, char endchar){
	stm_ret_t ret =receive_start_it(buffer_size);

	this->endchar = endchar;
	reception = USART_RECEPTION_TOENDCHAR;

	return ret;
}

stm_ret_t usart::receive_to_endchar_stop_it(void){
	this->endchar = '\0';
	return receive_stop_it();
}

#if ENABLE_DMA
stm_ret_t usart::receive_to_endchar_start_dma(uint16_t buffer_size, char endchar){
	stm_ret_t ret =receive_start_dma(buffer_size);

	this->endchar = endchar;
	reception = USART_RECEPTION_TOENDCHAR;

	__NVIC_ClearPendingIRQ(IRQn);
	__NVIC_EnableIRQ(IRQn);

	return ret;
}

stm_ret_t usart::receive_to_endchar_stop_dma(void){
	this->endchar = '\0';
	return receive_stop_dma();
}
#endif /* ENABLE_DMA */

stm_ret_t usart::get_buffer(uint8_t **data){
	stm_ret_t ret;

	if(rxbuffer != NULL){
		rxbuffer[rxcount+1] = '\0';
		*data = (uint8_t *)malloc(rxcount+1);
		if(data == NULL){
	#if CONFIG_USE_LOG_MONITOR && USART_LOG
			LOG_ERROR(TAG, "%s -> %s, USART memory allocation fail.", __FILE__, __FUNCTION__ );
	#endif
			set_return(&ret, STM_ERR, __LINE__);
			return ret;
		}
		memcpy(*data, rxbuffer, rxcount+1);

		free(rxbuffer);
		rxbuffer = NULL;

		return ret;
	}

	set_return(&ret, STM_ERR, __LINE__);
#if CONFIG_USE_LOG_MONITOR && USART_LOG
	LOG_ERROR(TAG, "%s -> %s, USART receive buffer empty.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && USART_LOG */

	return ret;
}


uint16_t usart::get_bufferlen(void){
	return rxcount;
}

usart_config_t *usart::get_config(void){
	return _conf;
}


void USART_IRQ_Handler(usart *usart){
	uint32_t StatusReg = usart -> _usart -> SR, CR1Reg = usart -> _usart -> CR1;
	usart_event_t event = USART_EVENT_NOEVENT;
	if(StatusReg & USART_SR_RXNE && CR1Reg & USART_CR1_RXNEIE) {
		volatile uint32_t tmp = usart -> _usart -> SR;
//		tmp = usart -> _usart -> DR;
		(void)tmp;

		event = USART_EVENT_RECEIVE_COMPLETE;
		usart -> _usart -> SR &=~ USART_SR_RXNE;

		if(usart -> rxcount < usart -> rxlen)
			usart -> rxbuffer[usart -> rxcount] = usart -> _usart -> DR;
		else{
			event = USART_EVENT_BUFFER_OVERFLOW;
			goto EventCB;
		}
		if(usart -> reception == USART_RECEPTION_TOENDCHAR){
			if(usart -> rxbuffer[usart -> rxcount] == usart -> endchar) {
				event = USART_EVENT_RECEIVE_ENDCHAR;
				usart -> _usart -> CR1 &=~ USART_CR1_PEIE;
				usart -> _usart -> CR3 &=~ USART_CR3_EIE;
			}
		}
		usart -> rxcount++;
		goto EventCB;
	}

