maivananh111/STM32_RTOSSDK/peripherals/source/usart.cpp
	if(StatusReg & USART_SR_TC&& CR1Reg & USART_CR1_TCIE) {
		volatile uint32_t tmp = usart -> _usart -> SR;
		tmp = usart -> _usart -> DR;
		(void)tmp;

		event = USART_EVENT_TRANSMIT_COMPLETE;
		usart -> _usart -> SR &=~ USART_SR_TC;

		goto EventCB;
	}

	if(StatusReg & USART_SR_IDLE && CR1Reg & USART_CR1_IDLEIE) {
		volatile uint32_t tmp = usart -> _usart -> SR;
		tmp = usart -> _usart -> DR;
		(void)tmp;

		if(usart -> reception == USART_RECEPTION_TOIDLE){
			usart -> _usart -> SR &=~ (USART_SR_IDLE | USART_SR_RXNE);
#if ENABLE_DMA
			if(usart -> _usart -> CR3 & USART_CR3_DMAR){
				usart -> rxcount = usart -> rxlen - usart -> _rxdma -> get_counter();
				if(usart -> _rxdma -> get_config() -> mode != DMA_MODE_CIRCULAR){
					usart -> _rxdma -> stop();
					usart -> _usart -> CR3 &=~ (USART_CR3_EIE | USART_CR3_DMAR);
				}
				event = USART_EVENT_IDLE_STATE;
				goto EventCB;
			}
			else{
#endif /* ENABLE_DMA */
				event = USART_EVENT_IDLE_STATE;
				goto EventCB;
#if ENABLE_DMA
			}
#endif /* ENABLE_DMA */
		}
	}

	EventCB:
	if(usart -> handler_callback != NULL) usart -> handler_callback(event, usart -> parameter);

}

#if defined(USART1)
usart usart_1(USART1);
usart_t usart1 = &usart_1;
void USART1_IRQHandler(void){
	USART_IRQ_Handler(&usart_1);
}
#endif /* defined(USART1) */
#if defined(USART2)
usart usart_2(USART2);
usart_t usart2 = &usart_2;
void USART2_IRQHandler(void){
	USART_IRQ_Handler(&usart_2);
}
#endif /* defined(USART2) */
#if defined(USART3)
usart usart_3(USART3);
usart_t usart3 = &usart_3;
void USART3_IRQHandler(void){
	USART_IRQ_Handler(&usart_3);
}
#endif /* defined(USART3) */
#if defined(UART4)
usart uart_4 (UART4);
usart_t uart4 = &uart_4;
void UART4_IRQHandler(void){
	USART_IRQ_Handler(&uart_4);
}
#endif /* defined(UART4) */
#if defined(UART5)
usart uart_5 (UART5);
usart_t uart5 = &uart_5;
void UART5_IRQHandler(void){
	USART_IRQ_Handler(&uart_5);
}
#endif /* defined(UART5) */
#if defined(USART6)
usart usart_6(USART6);
usart_t usart6 = &usart_6;
void USART6_IRQHandler(void){
	USART_IRQ_Handler(&usart_6);
}
#endif /* defined(USART6) */
#if defined(UART7)
usart uart_7 (UART7);
usart_t uart7 = &uart_7;
void UART7_IRQHandler(void){
	USART_IRQ_Handler(&uart_7);
}
#endif /* defined(UART7) */
#if defined(UART8)
usart uart_8 (UART8);
usart_t uart8 = &uart_8;
void UART8_IRQHandler(void){
	USART_IRQ_Handler(&uart_8);
}
#endif /* defined(UART8) */

#endif /* ENABLE_USART */





